validation/conventional/channelFlow/LES/SM/3D/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    pcorr
    {
		solver					GAMG;
		smoother				GaussSeidel;
        tolerance       		1e-05;
        relTol          		0;
    }

    pcorrFinal
    {
        $pcorr;
        relTol          		0;
    }

    p
    {
        solver          		PCG;
        preconditioner
        {
            preconditioner          GAMG;
            tolerance               1e-05;
            relTol                  0.01;
            smoother                DICGaussSeidel;
        }
        tolerance               1e-05;
        relTol                  0.01;
    }

    pFinal
    {
        $p;
        relTol          		0;
    }

    U
    {
        solver          		smoothSolver;
        smoother        		symGaussSeidel;
        tolerance       		1e-07;
        relTol          		0.1;
    }

    UFinal
    {
        $U;
        relTol          		0;
    }
}

PIMPLE
{
    nOuterCorrectors			1;
    nCorrectors                 2;
    nNonOrthogonalCorrectors	0;
    pRefCell					1000;
    pRefValue					0;
}

relaxationFactors
{
    fields
    {
        ".*"					1.0;
    }
    equations
    {
        ".*"					1.0;
    }
}

// ************************************************************************* //
